OSMICardsTo1Ci/src/Catalogs/ОСМИ_ЭлектроннаяКарта/ОСМИ_ЭлектроннаяКарта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ОСМИ_ЭлектроннаяКарта</name>
  <attributes>
    <name>Шаблон</name>
    <type>
      <types>CatalogRef.ОСМИ_ШаблонКарты</types>
    </type>
  </attributes>
  <attributes>
    <name>ДополнительнаяИнформация</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоляКарты</name>
    <attributes>
      <name>Поле</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>46</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИндивидуальныйИсточник</name>
      <type>
        <types>CatalogRef.ОСМИ_ИсточникДанных</types>
        <types>String</types>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

OSMICardsTo1Ci/src/Catalogs/ОСМИ_ЭлектроннаяКарта/Forms/ФормаЭлемента/Module.bsl
&НаСервере
Процедура СоздатьКартуНаСервере()
	Об = РеквизитФормыВЗначение("Объект");
	Об.СоздатьКарту();// Вставить содержимое обработчика.
КонецПроцедуры

&НаКлиенте
Процедура СоздатьКарту(Команда)
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		СоздатьКартуНаСервере();
	КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ОбновитьКартуНаСервере()
	
	Об = РеквизитФормыВЗначение("Объект");
	
	Об.УстановитьЗначенияПолей();//
	
	Карта = ОСМИ_РаботаСAPI.ЗапроситьИнформациюПокарте(Об.Код);
	
	Об.ПоляКарты.Очистить();
	
	Если Карта.Успех Тогда
		ЭтаФорма.Элементы.ФормаСоздатьКарту.Видимость = Ложь;
		
		Для Каждого Значение  из Карта.Ответ.values Цикл
			Стр = Об.ПоляКарты.Добавить();
			Стр.Поле = Значение.label;
			Стр.Значение = Значение.value; 
		КонецЦикла;
		
		Модифицированность = Истина;
		
	КонецЕсли;
	
	ЗначениеВРеквизитФормы(об,"Объект");
	
КонецПроцедуры

&НаКлиенте
Процедура ОбновитьКарту(Команда)
	
	Если Модифицированность Тогда
		ПоказатьПредупреждение(, "Электронную карту необходимо сначала записать!");
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(Объект.Шаблон) Тогда
		ОбновитьКартуНаСервере();
	Иначе
		ПоказатьПредупреждение(,"Не выбран шаблон!");
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
КонецПроцедуры
